Documents/А_ВыполнениеРаботМодулей.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ВыполнениеРаботМодулей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.А_ВыполнениеРаботМодулей</xr:Item>
				<xr:Item>InformationRegister.А_ПроцентыВыполненияМодулей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктураСебестоимости</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерМодуля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланЧасыМодуля</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧасыВыполнение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/А_ВыполнениеРаботМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ВыполнениеРаботМодулей</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧасыВыполнение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктураСебестоимости</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерМодуля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_ЭтапыРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/А_ПроцентыВыполненияМодулей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>А_ПроцентыВыполненияМодулей</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктураСебестоимости</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.А_СтруктураСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерМодуля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/А_ВыполнениеРаботМодулей/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Документ А_ВыполнениеРаботМодулей.
// Снимок НАКОПЛЕННЫХ процентов выполнения работ по модулям на дату документа
// (модель «снимок в документе + дельта в регистре», по образцу Rarus УСОERP_УчетВыполненныхРабот).
// ТЧ Работы нормализована: строка = Работа x НомерМодуля; матрицу «работа x модули»
// рисует форма (динамические колонки, эталон УстановкаЗначенийНефинансовыхПоказателей).
// Движения:
//  - РН.А_ВыполнениеРаботМодулей (обороты): ЧасыВыполнение = ПланЧасыМодуля x (Процент - ПроцентПред)/100 — ДЕЛЬТА;
//  - РС.А_ПроцентыВыполненияМодулей (по позиции регистратора): Процент — снимок для среза последних.
// Спец: docs/superpowers/specs/2026-07-06-выполнение-работ-модулей-design.md

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если ЗначениеЗаполнено(СтруктураСебестоимости) Тогда
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда
			Подразделение = СтруктураСебестоимости.Подразделение;
		КонецЕсли;
		Если КоличествоМодулей = 0 Тогда
			КоличествоМодулей = Макс(СтруктураСебестоимости.А_КоличествоМодулей, 1);
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	// Пустая работа и дубли ключа Работа x НомерМодуля -> Отказ (уникальность ключа РС).
	КлючиСтрок = Новый Соответствие;
	Для Каждого СтрокаРабот Из Работы Цикл
		ИндексСтроки = Работы.Индекс(СтрокаРабот);
		Если НЕ ЗначениеЗаполнено(СтрокаРабот.Работа) Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Строка %1: не заполнена работа'"), ИндексСтроки + 1),
				ЭтотОбъект, "Работы[" + ИндексСтроки + "].Работа",, Отказ);
			Продолжить;
		КонецЕсли;
		КлючСтроки = КлючРаботаМодуль(СтрокаРабот.Работа, СтрокаРабот.НомерМодуля);
		Если КлючиСтрок.Получить(КлючСтроки) <> Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Дубль: работа ""%1"", модуль %2 встречается более одного раза'"),
					СтрокаРабот.Работа, СтрокаРабот.НомерМодуля),
				ЭтотОбъект, "Работы[" + ИндексСтроки + "].Работа",, Отказ);
		КонецЕсли;
		КлючиСтрок.Вставить(КлючСтроки, Истина);
		Если СтрокаРабот.Процент < 0 ИЛИ СтрокаРабот.Процент > 100 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Работа ""%1"", модуль %2: процент %3 вне диапазона 0..100'"),
					СтрокаРабот.Работа, СтрокаРабот.НомерМодуля, СтрокаРабот.Процент),
				ЭтотОбъект, "Работы[" + ИндексСтроки + "].Процент",, Отказ);
		КонецЕсли;
		Если СтрокаРабот.НомерМодуля < 1 ИЛИ СтрокаРабот.НомерМодуля > КоличествоМодулей Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Работа ""%1"": номер модуля %2 вне диапазона 1..%3'"),
					СтрокаРабот.Работа, СтрокаРабот.НомерМодуля, КоличествоМодулей),
				ЭтотОбъект, "Работы[" + ИндексСтроки + "].НомерМодуля",, Отказ);
		КонецЕсли;
	КонецЦикла;

	// Неубывание против предыдущего снимка (исключая сам документ).
	ПредыдущиеПроценты = ПредыдущиеПроцентыМодулей();
	Для Каждого СтрокаРабот Из Работы Цикл
		КлючСтроки = КлючРаботаМодуль(СтрокаРабот.Работа, СтрокаРабот.НомерМодуля);
		ПроцентПред = ПредыдущиеПроценты.Получить(КлючСтроки);
		Если ПроцентПред <> Неопределено И СтрокаРабот.Процент < ПроцентПред Тогда
			ОбщегоНазначения.СообщитьПользователю(
				СтрШаблон(НСтр("ru = 'Работа ""%1"", модуль %2: процент %3 меньше зафиксированного ранее %4 (снижение выполнения)'"),
					СтрокаРабот.Работа, СтрокаРабот.НомерМодуля, СтрокаРабот.Процент, ПроцентПред),
				ЭтотОбъект, "Работы[" + Работы.Индекс(СтрокаРабот) + "].Процент");
			// Предупреждение без Отказа: корректировка вниз допустима осознанно (дельта уйдёт минусом).
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.А_ВыполнениеРаботМодулей.Записывать = Истина;
	Движения.А_ВыполнениеРаботМодулей.Очистить();
	Движения.А_ПроцентыВыполненияМодулей.Записывать = Истина;
	Движения.А_ПроцентыВыполненияМодулей.Очистить();

	ПредыдущиеПроценты = ПредыдущиеПроцентыМодулей();
	ПредупредитьОПозднихСнимках();

	НеохваченныеКлючи = Новый Соответствие;
	Для Каждого КлючЗначение Из ПредыдущиеПроценты Цикл
		НеохваченныеКлючи.Вставить(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;

	Для Каждого СтрокаРабот Из Работы Цикл

		КлючСтроки = КлючРаботаМодуль(СтрокаРабот.Работа, СтрокаРабот.НомерМодуля);
		ПроцентПред = ПредыдущиеПроценты.Получить(КлючСтроки);
		НеохваченныеКлючи.Удалить(КлючСтроки);
		Если ПроцентПред = Неопределено Тогда
			ПроцентПред = 0;
		КонецЕсли;
		СтрокаРабот.ПроцентНаНачало = ПроцентПред;

		ДельтаПроцент = СтрокаРабот.Процент - ПроцентПред;
		ЧасыДельта = СтрокаРабот.ПланЧасыМодуля * ДельтаПроцент / 100;

		Если ЧасыДельта <> 0 Тогда
			Движение = Движения.А_ВыполнениеРаботМодулей.Добавить();
			Движение.Период                 = Дата;
			Движение.СтруктураСебестоимости = СтруктураСебестоимости;
			Движение.Подразделение          = Подразделение;
			Движение.Работа                 = СтрокаРабот.Работа;
			Движение.НомерМодуля            = СтрокаРабот.НомерМодуля;
			Движение.Этап                   = СтрокаРабот.Этап;
			Движение.ЧасыВыполнение         = ЧасыДельта;
		КонецЕсли;

		// Снимок процента пишем всегда (в т.ч. 0 после корректировки вниз) — срез последних должен видеть актуальное.
		ЗаписьСреза = Движения.А_ПроцентыВыполненияМодулей.Добавить();
		ЗаписьСреза.Период                 = Дата;
		ЗаписьСреза.СтруктураСебестоимости = СтруктураСебестоимости;
		ЗаписьСреза.Работа                 = СтрокаРабот.Работа;
		ЗаписьСреза.НомерМодуля            = СтрокаРабот.НомерМодуля;
		ЗаписьСреза.Процент                = СтрокаРабот.Процент;

	КонецЦикла;

	// Работы предыдущего снимка, отсутствующие в этом документе: их % и EV не изменятся — предупредить.
	Для Каждого КлючЗначение Из НеохваченныеКлючи Цикл
		Если КлючЗначение.Значение > 0 Тогда
			ОбщегоНазначения.СообщитьПользователю(
				НСтр("ru = 'В снимке отсутствуют работы/модули предыдущего снимка с ненулевым процентом — их выполнение не изменится. Заполните документ по предыдущему.'"),
				ЭтотОбъект);
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПредупредитьОПозднихСнимках();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Предыдущий снимок процентов по СС: срез последних СТРОГО ДО ПОЗИЦИИ документа
// (Граница Исключая по МоментВремени(Дата, Ссылка)) — корректно и для документов одной секундой,
// и при перепроведении (собственные записи за границей).
//
// Возвращаемое значение:
//  Соответствие - ключ "УИДРаботы|НомерМодуля" -> Процент (Число).
Функция ПредыдущиеПроцентыМодулей()

	Результат = Новый Соответствие;
	Если НЕ ЗначениеЗаполнено(СтруктураСебестоимости) Тогда
		Возврат Результат;
	КонецЕсли;

	ГраницаСреза = Новый Граница(Новый МоментВремени(Дата, Ссылка), ВидГраницы.Исключая);

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СС", СтруктураСебестоимости);
	Запрос.УстановитьПараметр("Граница", ГраницаСреза);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СРЕЗ.Работа КАК Работа,
	|	СРЕЗ.НомерМодуля КАК НомерМодуля,
	|	СРЕЗ.Процент КАК Процент
	|ИЗ
	|	РегистрСведений.А_ПроцентыВыполненияМодулей.СрезПоследних(&Граница, СтруктураСебестоимости = &СС) КАК СРЕЗ";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(КлючРаботаМодуль(Выборка.Работа, Выборка.НомерМодуля), Выборка.Процент);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Проведение/распроведение задним числом: более поздние снимки той же СС становятся
// неконсистентными (их дельты считались от прежнего состояния) — предупреждаем,
// историю перепроводит пользователь (конвенция проекта).
Процедура ПредупредитьОПозднихСнимках()

	Если НЕ ЗначениеЗаполнено(СтруктураСебестоимости) Тогда
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СС", СтруктураСебестоимости);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	|	П.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрСведений.А_ПроцентыВыполненияМодулей КАК П
	|ГДЕ
	|	П.СтруктураСебестоимости = &СС
	|	И П.Регистратор <> &Ссылка
	|	И П.Период > &Дата";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Есть более поздний снимок %1 — после изменения этого документа его нужно перепровести'"),
				Выборка.Регистратор), ЭтотОбъект);
	КонецЦикла;

КонецПроцедуры

Функция КлючРаботаМодуль(Работа, НомерМодуля)
	Возврат Строка(Работа.УникальныйИдентификатор()) + "|" + Формат(НомерМодуля, "ЧГ=0");
КонецФункции

#КонецОбласти

#КонецЕсли
